src/index.tex
% Created 2017-01-25 Wed 09:08
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{VLEAD}
\date{\today}
\title{Portable-Media for College/Institute.}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{Introduction}
\label{sec-1}
Use the portable media and conduct the workshop offline in any
college or institute.
The document contains mainly about the workshops to be conducted offline in various institutes using portable-media.
\section{Objective of the workshop}
\label{sec-2}
\begin{itemize}
\item Portable media should be able to serve the labs to the students
to perform experiments or to use the labs without the Internet
connection.

\item Conduct the workshop offline using portable-media.

\item After the workshop, Collect the analytics and feedbacks using the
shell script that is located in \texttt{/root/workshop-analytics/} on
portable media. Send these analytics and feedback to
\texttt{engg@vlabs.ac.in} ( Central repository of analyitics)

\item Note down the issues if there are any, during the workshop and
report the issues to \texttt{engg@vlabs.ac.in}
\end{itemize}

\section{Requirements for the workshop}
\label{sec-3}
\subsection{Requirements from College/Institute}
\label{sec-3-1}
\begin{itemize}
\item Minimum system configuration.
\begin{verbatim}
Processor : Intel(R) Core(TM) i7-3770 CPU @ 3.40GHz   ( Model : intel-db75en)
RAM : 16 GB
SMPS : 600 W
CPUs: 8
MotherBoard wattage: 77 W
\end{verbatim}
\end{itemize}

The above system configuration is suitable for following 
\begin{itemize}
\item Less number of labs( 5-10 ) will be running in the cluster
\item 5-10 students will be using those  labs.
\end{itemize}


If we can use better processor than the above processor such as
\texttt{Intel Xenon} processor and good enough RAM(32 GB), So that we can
use this portable media without any limitations.
\begin{itemize}
\item Wi-Fi Router
\item 8/16/24 port switch (Optional)
\item LAN cables
\item USB (Pendrive) 4GB at least, to collect analytics and feedbacks
\item Active Internet connection to send the collected analytics and
feedbacks from pendrive to \texttt{engg@vlabs.ac.in}
\end{itemize}

\subsection{Requirements from VLEAD}
\label{sec-3-2}
\begin{itemize}
\item Portable-Media
\item Wi-Fi router
\item LAN cables
\item \href{./user-manual-for-portablemedia.org}{User Manual}
\item 4GB Pendrive
\end{itemize}
\section{Workshops}
\label{sec-4}
\subsection{GMRIT, Srikakulam, 9th Jan 2017 and 10th Jan 2017.}
\label{sec-4-1}
\begin{itemize}
\item \href{./GMRIT-Srikakula.org}{GMRIT,Srikakulam}
\end{itemize}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
